; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph5 - mode
	spectrograph3 - mode
	thermograph1 - mode
	spectrograph2 - mode
	spectrograph4 - mode
	image0 - mode
	Star6 - direction
	GroundStation0 - direction
	Star2 - direction
	Star4 - direction
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument1 image0)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph4)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 Star4)
	(supports instrument6 image0)
	(supports instrument6 spectrograph4)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star3)
	(supports instrument8 thermograph5)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation7)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation7)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite1 Phenomenon11)
	(pointing satellite2 Star4)
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 spectrograph4)
	(have_image Planet10 thermograph1)
	(have_image Planet10 spectrograph4)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon12 thermograph5)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon13 spectrograph4)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 12
2. (calibrate satellite4 instrument8 groundstation7)
   added: (calibrated instrument8)
   goals met: 0 of 12
3. (turn_to satellite4 phenomenon9 groundstation7)
   deleted: (pointing satellite4 groundstation7)
   added: (pointing satellite4 phenomenon9)
   goals met: 0 of 12
4. (take_image satellite4 phenomenon9 instrument8 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 1 of 12
5. (turn_to satellite4 phenomenon12 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 12
6. (turn_to satellite3 groundstation5 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation5)
   goals met: 1 of 12
7. (turn_to satellite2 star4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star4)
   goals met: 2 of 12
8. (turn_to satellite1 groundstation0 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 12
9. (turn_to satellite0 planet10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet10)
   goals met: 3 of 12
10. (take_image satellite4 phenomenon12 instrument8 thermograph5)
   added: (have_image phenomenon12 thermograph5)
   goals met: 4 of 12
11. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 4 of 12
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 12
13. (calibrate satellite3 instrument6 groundstation5)
   added: (calibrated instrument6)
   goals met: 4 of 12
14. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 4 of 12
15. (turn_to satellite1 planet10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet10)
   goals met: 4 of 12
16. (take_image satellite1 planet10 instrument2 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 5 of 12
17. (turn_to satellite1 phenomenon11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 12
18. (turn_to satellite3 phenomenon11 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 phenomenon11)
   goals met: 6 of 12
19. (take_image satellite3 phenomenon11 instrument6 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 7 of 12
20. (turn_to satellite3 phenomenon12 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon12)
   goals met: 7 of 12
21. (take_image satellite3 phenomenon12 instrument6 image0)
   added: (have_image phenomenon12 image0)
   goals met: 8 of 12
22. (turn_to satellite3 phenomenon13 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon13)
   goals met: 8 of 12
23. (take_image satellite3 phenomenon13 instrument6 image0)
   added: (have_image phenomenon13 image0)
   goals met: 9 of 12
24. (take_image satellite3 phenomenon13 instrument6 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 10 of 12
25. (turn_to satellite3 planet10 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 planet10)
   goals met: 10 of 12
26. (take_image satellite3 planet10 instrument6 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 11 of 12
27. (turn_to satellite3 star8 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star8)
   goals met: 11 of 12
28. (take_image satellite3 star8 instrument6 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 12 of 12
